# data preprocessing

In [1]:
# missing valuelarni toldirish
import pandas as pd
df=pd.read_csv('Titanic-DatasetClassification.csv')

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df.isnull().sum()    # tushib qolgan qiymatlarni korish

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df['Cabin']   # 1ta ustunni korish

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [7]:
df[['Cabin','Embarked','Fare','Age']]    # Bir nechta ustunni korish

    Cabin Embarked     Fare   Age
0     NaN        S   7.2500  22.0
1     C85        C  71.2833  38.0
2     NaN        S   7.9250  26.0
3    C123        S  53.1000  35.0
4     NaN        S   8.0500  35.0
..    ...      ...      ...   ...
886   NaN        S  13.0000  27.0
887   B42        S  30.0000  19.0
888   NaN        S  23.4500  28.0
889  C148        C  30.0000  26.0
890   NaN        Q   7.7500  32.0

[891 rows x 4 columns]

In [ ]:
# Mean bilan toldirish

df['Age'].fillna(df['Age'].mean(),inplace=True)

# fillna  - toldir
# inplace=True  -  original datasetni ozgartiradi

In [7]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# Mode bilan toldirish

df['Cabin'].fillna(df['Cabin'].mode()[0],inplace=True)

# mode()[0]   -   eng kop takrorlangan qiymatlarni 1 chisi bilan toldir

In [9]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [ ]:
# median bilan toldirish

df['Age'].fillna(df['Age'].median(),inplace=True)

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [2]:
# restart
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# fixed qiymat bilan toldirish

df['Age'].fillna(38.0,inplace=True)       # raqam bilan toldirish

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df['Cabin'].fillna('B42',inplace=True)     # Text bilan toldirish

In [6]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [ ]:
# Drop qilib ustun(column)ni tashlab yuborish(yani eng kop tushib qolgan qiymati bor ustunnni tashlab yuboramiz)
# raw - qator

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df.drop('Cabin',axis=1,inplace=True)

# axis=1  -  ustunni belgilaydi
# axis=0  -  qatorni belgilaydi

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

# Encoding

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [9]:
df['Sex'].value_counts()   # qiymatlarni nechtadan borligini va turlarini korish,yani umumiy malumot)

Sex
male      577
female    314
Name: count, dtype: int64

In [ ]:
df['Survived'].value_counts().sum()   #  umumiy qiymatlarni sonini korish

891

One hot encoding

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [ ]:
dummies=pd.get_dummies(df['Sex'],prefix='Sex',dtype=int)

# One hot  encoding ustunni ichida nechta qator bolsa shu qatorlarni barchasini ustunga aylantirib beradi
# prefix bu har bir yaratilayotgan ustunni oldiga soz qoyish(Sex_female,Sex_male)

In [12]:
dummies

     Sex_female  Sex_male
0             0         1
1             1         0
2             1         0
3             1         0
4             0         1
..          ...       ...
886           0         1
887           1         0
888           1         0
889           0         1
890           0         1

[891 rows x 2 columns]

In [ ]:
df=pd.concat([df.drop(columns='Sex'),dummies],axis=1)

# pd.concat   bu qatordan yaratgan ustunimizni original datasetga qoshadi

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Embarked     889 non-null    object
 10  Sex_female   891 non-null    int32
 11  Sex_male     891 non-null    int32
dtypes: float64(2), int32(2), int64(5), object(3)
memory usage: 76.7+ KB

Label Encoding

In [15]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [16]:
df['Name']=encoder.fit_transform(df['Name'])

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    int32
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Embarked     889 non-null    object
 10  Sex_female   891 non-null    int32
 11  Sex_male     891 non-null    int32
dtypes: float64(2), int32(3), int64(5), object(2)
memory usage: 73.2+ KB

# Scaling

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
from sklearn.preprocessing import MinMaxScaler,StandardScaler,RobustScaler

In [14]:
min_max_scaler=MinMaxScaler()
standard=StandardScaler()
robust=RobustScaler()

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
df['Fare']=min_max_scaler.fit_transform(df[['Fare']])

In [16]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,0.014151,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,0.139136,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,0.015469,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,0.103644,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,0.015713,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,0.016510,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,0.101229,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,0.041136,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,0.021731,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,0.058694,NaN,C

In [19]:
# Standard scaler bilan
df['Pclass']=standard.fit_transform(df[['Pclass']])

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,0.827377,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,0.014151,NaN,S
1,2,1,-1.566107,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,0.139136,C85,C
2,3,1,0.827377,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,0.015469,NaN,S
3,4,1,-1.566107,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,0.103644,C123,S
4,5,0,0.827377,"Allen, Mr. William Henry",male,35.0,0,0,373450,0.015713,NaN,S

In [21]:
# Robust Scaler bilan
df['Parch']=robust.fit_transform(df[['Parch']])

In [22]:
df.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,0.827377,"Braund, Mr. Owen Harris",male,22.0,1,0.0,A/5 21171,0.014151,NaN,S
1,2,1,-1.566107,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0.0,PC 17599,0.139136,C85,C
2,3,1,0.827377,"Heikkinen, Miss. Laina",female,26.0,0,0.0,STON/O2. 3101282,0.015469,NaN,S
3,4,1,-1.566107,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0.0,113803,0.103644,C123,S
4,5,0,0.827377,"Allen, Mr. William Henry",male,35.0,0,0.0,373450,0.015713,NaN,S
5,6,0,0.827377,"Moran, Mr. James",male,NaN,0,0.0,330877,0.016510,NaN,Q
6,7,0,-1.566107,"McCarthy, Mr. Timothy J",male,54.0,0,0.0,17463,0.101229,E46,S
7,8,0,0.827377,"Palsson, Master. Gosta Leonard",male,2.0,3,1.0,349909,0.041136,NaN,S
8,9,1,0.827377,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2.0,347742,0.021731,NaN,S
9,10,1,-0.369365,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0.0,237736,0.058694,NaN,C
10,11,1,0.827377,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1.0,PP 9549,0.032596,G6,S
11,12,1,-1.566107,"Bonnell, Miss. Elizabeth",female,58.0,0,0.0,113783,0.051822,C103,S
12,13,0,0.827377,"Saundercock, Mr. William Henry",male,20.0,0,0.0,A/5. 2151,0.015713,NaN,S
13,14,0,0.827377,"Andersson, Mr. Anders Johan",male,39.0,1,5.0,347082,0.061045,NaN,S
14,15,0,0.827377,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0.0,350406,0.015330,NaN,S

# operatorlar(belgilar)

In [ ]:
# arifmetik(matematik) operatorlar
+,-,*,/,//,%,**

In [ ]:
a=12
b=8
print(a+b)
print(a-b)
print(a*b)
print(a/b)  #bolish
print(a//b)  # bolganda faqat butun qismini olish
print(a%b)  # qoldiqni topish
print(a**b)  #  darajasini topish

20
4
96
1.5
1
4
429981696

In [ ]:
# Relational operatorlar
<,>,<=,>=,==(TENG),!=(TENG EMAS)

In [24]:
a=3
b=1
a>b

True

In [25]:
# Logical operatorlar
a=3
a%2!=0 and a>0

True

In [26]:
a=3
a%2!=0 or a>0

True

In [ ]:
a%2!=0 or not (a>0)

In [ ]:
# Assignment operatorlar

x=x+5

x+=5

In [ ]:
y=y*7

y*=7

# Conditions

In [27]:
# Berilgan son faqat musbat bolsagina ok degan sozni ekranga chiqaring
a=8
if a>0:
    print('ok')

ok

In [28]:
a=-4
if a>0:
    print('ok')
else:
    print('manfiy')

manfiy

In [30]:
a=0
if a>0:
    print('ok')
elif a==0:
    print('nolga teng')
else:
    print('manfiy')

nolga teng

In [31]:
# Oquvchini baxoleng
baxo=int(input('baxoni kirgazing:'))
if baxo==5:
    print('Alo')
elif baxo==4:
    print('Yaxshi')
elif baxo==3:
    print('Ortacha')
elif baxo==2:
    print('Yomon')
elif baxo==1:
    print('Juda yomon')
else:
    print('xato baxo kiritilgan')

Alo